chfanghr/SDK-devices-LPC54606-drivers-/SDK/components/flash/nor/spifi/fsl_spifi_nor_flash.c
/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/*! @brief Send Write Enable command to Serial NOR via SPIFI */
static status_t spifi_nor_write_enable(SPIFI_Type *base,
                                       spifi_mem_nor_handle_t *handle,
                                       spifi_command_format_t cmdFormat);
/*! @brief Send read status command to Serial NOR via SPIFI */
static uint8_t spifi_nor_read_status(SPIFI_Type *base, uint8_t readCmd);
/*! @brief Enable nor flash quad mode via SPIFI */
static status_t spifi_nor_quad_mode_enable(SPIFI_Type *base,
                                           spifi_nor_config_t *config,
                                           spifi_mem_nor_handle_t *memHandle);
/*! @brief Parse SFDP parameters and then fill into SPIFI Serial NOR Configuration Block */
static status_t spifi_nor_parse_sfdp(spifi_nor_config_t *config,
                                     jedec_info_table_t *tbl,
                                     spifi_mem_nor_config_t *memConfig,
                                     nor_handle_t *handle);
/*! @brief Read SFDP information via SPIFI */
static status_t spifi_nor_read_sfdp_info(SPIFI_Type *base, jedec_info_table_t *tbl);
/*! @brief Read SFDP info specified by arguments */
static status_t spifi_nor_read_sfdp(SPIFI_Type *base, uint32_t address, uint32_t *buffer, uint32_t bytes);
/*! @brief Get page/sector size from SFDP */
static status_t spifi_get_page_sector_size_from_sfdp(nor_handle_t *handle, jedec_info_table_t *tbl);
/*! @brief Sector erase with the minimum supported sector size */
static status_t spifi_nor_erase_sector(nor_handle_t *handle, uint32_t address);
/*! @brief Sector write protection disabled */
static status_t spifi_nor_writeprotect_disable(SPIFI_Type *base, spifi_mem_nor_handle_t *memHandle);
/*******************************************************************************
 * Variables
 ******************************************************************************/
spifi_mem_nor_handle_t spifi_handle;

/*******************************************************************************
 * Code
 ******************************************************************************/

static uint8_t spifi_nor_read_status(SPIFI_Type *base, uint8_t readCmd)
{
    spifi_command_t cmd;
    uint8_t value;

    cmd.dataLen           = 0x01U;
    cmd.isPollMode        = false;
    cmd.direction         = kSPIFI_DataInput;
    cmd.intermediateBytes = 0;
    cmd.format            = kSPIFI_CommandAllSerial;
    cmd.type              = kSPIFI_CommandOpcodeOnly;
    cmd.opcode            = readCmd;
    SPIFI_SetCommand(base, &cmd);
    value = *(uint8_t *)&base->DATA;

    return value;
}

static status_t spifi_check_norflash_finish(SPIFI_Type *base, spifi_mem_nor_handle_t *handle)
{
    spifi_command_t cmd;
    uint8_t value;

    /* Using hardware POLL mode to get matched status value.
     * And set DATALEN as 0 means choosing bit0 of Norflash status register to compare with bit3,
     * if both of them are 0, that is, flash is in IDLE state, will trigger INIRQ as 1 in
     * STATUS register.
     */
    cmd.dataLen           = 0x00;
    cmd.isPollMode        = true;
    cmd.direction         = kSPIFI_DataInput;
    cmd.intermediateBytes = 0;
    cmd.format            = kSPIFI_CommandAllSerial;
    cmd.type              = kSPIFI_CommandOpcodeOnly;
    cmd.opcode            = handle->commandSet.readStatusCommand;

    /* Clear INTRQ bit first, perhaps set by the previous operation. */
    base->STAT = SPIFI_STAT_INTRQ_MASK;
    SPIFI_SetCommand(base, &cmd);
    while ((base->STAT & SPIFI_STAT_INTRQ_MASK) == 0U)
    {
    }
    value = *(uint8_t *)&base->DATA;

    return (value & 0x01U) ? kStatus_Fail : kStatus_Success;
}

static status_t spifi_nor_write_enable(SPIFI_Type *base,
                                       spifi_mem_nor_handle_t *handle,
                                       spifi_command_format_t cmdFormat)
{
    spifi_command_t cmd;
    status_t status;
    uint8_t value;

    /* Enable write operation. */
    cmd.dataLen           = 0;
    cmd.isPollMode        = false;
    cmd.direction         = kSPIFI_DataOutput;
    cmd.intermediateBytes = 0;
    cmd.format            = cmdFormat;
    cmd.type              = kSPIFI_CommandOpcodeOnly;
    cmd.opcode            = handle->commandSet.writeEnableCommand;
    SPIFI_SetCommand(base, &cmd);

    status = spifi_check_norflash_finish(base, handle);
    /* check whether enable write operation success. */
    value = spifi_nor_read_status(base, handle->commandSet.readStatusCommand);
    if (0 == (value & 0x2U))
    {
        return kStatus_Fail;
    }

    return status;
}

static status_t spifi_nor_quad_mode_enable(SPIFI_Type *base,
                                           spifi_nor_config_t *config,
                                           spifi_mem_nor_handle_t *memHandle)
{
    spifi_command_t cmd;
    status_t status;
    uint8_t quadValue;
    uint8_t valueAfter;

    if (kSerialNorCmd_Invalid == config->quadDualreadCommand)
    {
        return kStatus_InvalidArgument;
    }

    /* Read status register which contain quad/dual enable bit. */
    quadValue = spifi_nor_read_status(base, config->quadDualreadCommand);
    /* Check whether the mode need to switich.
       Only consider the bit value in the quad spi mode is 1 here.*/
    if (quadValue & (0x1U << config->quadDualEnableBitShift))
    {
        return kStatus_Success;
    }

    do
    {
        /* Enable write operation. */
        status = spifi_nor_write_enable(base, memHandle, kSPIFI_CommandAllSerial);
        if (kStatus_Success != status)
        {
            return status;
        }

        if (true == config->writeTwoStausBytes)
        {
            uint8_t valueStatus;
            uint16_t valueSwitch;
            /* Read status register1 to combine the value of two status registers, then write it back.
               This opration can maintain the state of all other writable status register bits*/
            valueStatus = spifi_nor_read_status(base, memHandle->commandSet.readStatusCommand);
            valueSwitch = valueStatus | ((quadValue | (0x1U << config->quadDualEnableBitShift)) << 8);

            /* Enable quad/dual spi mode. */
            cmd.dataLen           = 0x02U;
            cmd.isPollMode        = false;
            cmd.direction         = kSPIFI_DataOutput;
            cmd.intermediateBytes = 0;
            cmd.format            = kSPIFI_CommandAllSerial;
            cmd.type              = kSPIFI_CommandOpcodeOnly;
            cmd.opcode            = memHandle->commandSet.writeStatusCommand;
            SPIFI_SetCommand(base, &cmd);
            SPIFI_WriteDataHalfword(base, valueSwitch);
        }
        else
        {
            /* Enable quad/dual spi mode. */
            cmd.dataLen           = 0x01U;
            cmd.isPollMode        = false;
            cmd.direction         = kSPIFI_DataOutput;
            cmd.intermediateBytes = 0;
            cmd.format            = kSPIFI_CommandAllSerial;
            cmd.type              = kSPIFI_CommandOpcodeOnly;
            cmd.opcode            = config->quadDualEnableCommand;
            SPIFI_SetCommand(base, &cmd);
            SPIFI_WriteDataByte(base, (quadValue | (0x1U << config->quadDualEnableBitShift)));
        }

        status = spifi_check_norflash_finish(base, memHandle);
        if (kStatus_Success != status)
        {
            return status;
        }

        /* Read status register which contain quad/dual enable bit to check whether swtich opration success. */
        valueAfter = spifi_nor_read_status(base, config->quadDualreadCommand);
    } while ((valueAfter & (0x1U << config->quadDualEnableBitShift)) == 0);

    return kStatus_Success;
}

static status_t spifi_nor_read_sfdp(SPIFI_Type *base, uint32_t address, uint32_t *buffer, uint32_t bytes)
{
    spifi_command_t cmd;

