chfanghr/SDK-devices-LPC54606-drivers-/SDK/components/flash/nor/spifi/fsl_spifi_nor_flash.c
    cmd.isPollMode        = false;
    cmd.direction         = kSPIFI_DataInput;
    cmd.intermediateBytes = 1;
    cmd.format            = kSPIFI_CommandAllSerial;
    cmd.type              = kSPIFI_CommandOpcodeAddrThreeBytes;
    cmd.opcode            = kSerialFlash_ReadSFDP;
    SPIFI_SetMemoryCommand(base, &cmd);

    memcpy(buffer, (void *)(address + FSL_FEATURE_SPIFI_START_ADDR), bytes);
    /* Reset to command mode. */
    SPIFI_ResetCommand(base);

    return kStatus_Success;
}

static status_t spifi_nor_writeprotect_disable(SPIFI_Type *base, spifi_mem_nor_handle_t *memHandle)
{
    spifi_command_t cmd;

    /* Disable write protection. */
    cmd.dataLen           = 1U;
    cmd.isPollMode        = false;
    cmd.direction         = kSPIFI_DataOutput;
    cmd.intermediateBytes = 0;
    cmd.format            = kSPIFI_CommandAllSerial;
    cmd.type              = kSPIFI_CommandOpcodeOnly;
    cmd.opcode            = memHandle->commandSet.writeStatusCommand;
    SPIFI_SetCommand(base, &cmd);
    *(uint8_t *)&base->DATA = 0x00;

    return spifi_check_norflash_finish(base, memHandle);
}

static status_t spifi_nor_read_sfdp_info(SPIFI_Type *base, jedec_info_table_t *tbl)
{
    status_t status = kStatus_Fail;
    do
    {
        if (tbl == NULL)
        {
            status = kStatus_InvalidArgument;
            break;
        }

        sfdp_header_t sfdp_header;
        uint32_t address;
        /* Read SFDP header */
        status = spifi_nor_read_sfdp(base, 0, (uint32_t *)&sfdp_header, sizeof(sfdp_header));
        if (status != kStatus_Success)
        {
            break;
        }

        if (sfdp_header.signature != NOR_SFDP_SIGNATURE)
        {
            break;
        }

        tbl->standard_version = sfdp_header.minor_rev;

        uint32_t parameter_header_number = sfdp_header.param_hdr_num + 1;
        sfdp_parameter_header_t sfdp_param_hdrs[10];
        uint32_t max_hdr_count = parameter_header_number > 10 ? 10 : parameter_header_number;
        address                = 0x08;
        /* Read parameter headers */
        status = spifi_nor_read_sfdp(base, address, (uint32_t *)&sfdp_param_hdrs[0],
                                     max_hdr_count * sizeof(sfdp_parameter_header_t));
        if (status != kStatus_Success)
        {
            break;
        }
        memset(tbl, 0, sizeof(*tbl));

        for (uint32_t i = 0; i < max_hdr_count; i++)
        {
            uint32_t parameter_id =
                sfdp_param_hdrs[i].parameter_id_lsb + ((uint32_t)sfdp_param_hdrs[i].parameter_id_msb << 8);

            if ((parameter_id == kParameterID_BasicSpiProtocol) ||
                (parameter_id == kParameterID_4ByteAddressInstructionTable))
            {
                address = 0;
                for (int32_t index = 2; index >= 0; index--)
                {
                    address <<= 8;
                    address |= sfdp_param_hdrs[i].parameter_table_pointer[index];
                }
                uint32_t table_size = sfdp_param_hdrs[i].table_length_in_32bit * sizeof(uint32_t);

                if (parameter_id == kParameterID_BasicSpiProtocol)
                {
                    /* Limit table size to the max supported standard */
                    if (table_size > sizeof(jedec_flash_param_table_t))
                    {
                        table_size = sizeof(jedec_flash_param_table_t);
                    }
                    /* Read Basic SPI Protocol Table */
                    status = spifi_nor_read_sfdp(base, address, (uint32_t *)&tbl->flash_param_tbl, table_size);
                    if (status != kStatus_Success)
                    {
                        break;
                    }
                    tbl->flash_param_tbl_size = table_size;
                }
                else if (parameter_id == kParameterID_4ByteAddressInstructionTable)
                {
                    /* Read 4-byte Address Instruction Table */
                    status = spifi_nor_read_sfdp(base, address, (uint32_t *)&tbl->flash_4b_inst_tbl, table_size);
                    if (status != kStatus_Success)
                    {
                        break;
                    }
                    tbl->has_4b_addressing_inst_table = true;
                }
            }
            else
            {
                /* Unsupported parameter type, ignore */
            }
        }

    } while (0);

    return status;
}

static status_t spifi_get_page_sector_size_from_sfdp(nor_handle_t *handle, jedec_info_table_t *tbl)
{
    jedec_flash_param_table_t *param_tbl              = &tbl->flash_param_tbl;
    jedec_4byte_addressing_inst_table_t *flash_4b_tbl = &tbl->flash_4b_inst_tbl;
    spifi_mem_nor_handle_t *memHandle                 = (spifi_mem_nor_handle_t *)handle->deviceSpecific;

    uint32_t flash_size;
    uint32_t flash_density = tbl->flash_param_tbl.flash_density;

    if (flash_density & (1U << 0x1F))
    {
        /* Flash size >= 4G bits */
        flash_size = 1U << ((flash_density & ~(1U << 0x1F)) - 3);
    }
    else
    {
        /* Flash size < 4G bits */
        flash_size = (flash_density + 1) >> 3;
    }
    handle->bytesInMemorySize = flash_size;

    /* Calculate Page size */
    uint32_t page_size;
    if (tbl->flash_param_tbl_size < 64U)
    {
        handle->bytesInPageSize = 256U;
    }
    else
    {
        page_size               = 1 << (param_tbl->chip_erase_progrm_info.page_size);
        handle->bytesInPageSize = page_size == (1 << 15) ? 256U : page_size;
    }

    /* Calculate Sector Size */
    uint32_t sector_size       = 1U << SPIFI_256K_SECTOR_SIZE_OFFSET;
    uint32_t sector_erase_type = 0;

    for (uint32_t index = 0; index < 4; index++)
    {
        if (param_tbl->erase_info[index].size != 0)
        {
            uint32_t current_erase_size = 1U << param_tbl->erase_info[index].size;
            if ((current_erase_size < sector_size) && (current_erase_size < (1024U * 1024U)))
            {
                sector_size       = current_erase_size;
                sector_erase_type = index;
            }
        }
    }

    handle->bytesInSectorSize = sector_size;

