chfanghr/SDK-devices-LPC54606-drivers-/SDK/components/flash/nor/spifi/fsl_spifi_nor_flash.c
    if (handle->bytesInMemorySize > SPIFI_MAX_24BIT_ADDRESSING_SIZE)
    {
        if (tbl->has_4b_addressing_inst_table)
        {
            memHandle->commandSet.eraseSectorCommand = flash_4b_tbl->erase_inst_info.erase_inst[sector_erase_type];
        }
        else
        {
            switch (param_tbl->erase_info[sector_erase_type].inst)
            {
                case kSerialNorCmd_EraseSector4KB:
                    memHandle->commandSet.eraseSectorCommand = kSerialNorCmd_EraseSector4KBA32;
                    break;
                case kSerialNorCmd_EraseSector:
                    memHandle->commandSet.eraseSectorCommand = kSerialNorCmd_EraseSectorA32;
                    break;
            }
        }
    }
    else
    {
        memHandle->commandSet.eraseSectorCommand = param_tbl->erase_info[sector_erase_type].inst;
    }

    return kStatus_Success;
}

static status_t spifi_nor_parse_sfdp(spifi_nor_config_t *config,
                                     jedec_info_table_t *tbl,
                                     spifi_mem_nor_config_t *memConfig,
                                     nor_handle_t *handle)
{
    status_t status                   = kStatus_InvalidArgument;
    spifi_mem_nor_handle_t *memHandle = (spifi_mem_nor_handle_t *)handle->deviceSpecific;

    do
    {
        jedec_flash_param_table_t *param_tbl              = &tbl->flash_param_tbl;
        jedec_4byte_addressing_inst_table_t *flash_4b_tbl = &tbl->flash_4b_inst_tbl;
        uint8_t quadModeSetting                           = kSerialNorQuadMode_NotConfig;

        uint32_t dummy_cycles = 0;
        uint8_t mode_cycles   = 0;
        uint32_t address_bits = 24U;

        spifi_get_page_sector_size_from_sfdp(handle, tbl);

        if (param_tbl->misc.address_bits == 2U)
        {
            memHandle->commandType = kSPIFI_CommandOpcodeAddrFourBytes;
        }
        else
        {
            memHandle->commandType = kSPIFI_CommandOpcodeAddrThreeBytes;
        }

        if (handle->bytesInMemorySize > SPIFI_MAX_24BIT_ADDRESSING_SIZE)
        {
            address_bits                                 = 32U;
            memHandle->commandSet.pageWriteMemoryCommand = kSerialNorCmd_WriteMemoryA32;
            memHandle->commandSet.readMemoryCommand      = kSerialNorCmd_ReadMemoryA32;
        }

        memHandle->readmemCommandFormt = (spifi_command_format_t)memConfig->cmd_format;

        if (kSPIFI_CommandAllSerial != memHandle->readmemCommandFormt)
        {
            if (kSPIFI_CommandOpcodeSerial == memHandle->readmemCommandFormt &&
                param_tbl->misc.supports_1_4_4_fast_read)
            {
                mode_cycles  = param_tbl->read_1_4_info.mode_clocks_1_4_4_read;
                dummy_cycles = param_tbl->read_1_4_info.dummy_clocks_1_4_4_read;
                /* Calculate intermediate bytes precede the data */
                memHandle->intermediateLen              = (mode_cycles + dummy_cycles) / 2U;
                memHandle->commandSet.readMemoryCommand = kSerialNorCmd_ReadMemorySDR_1_4_4;
                if ((address_bits == 32U) && flash_4b_tbl->cmd_4byte_support_info.support_1_4_4_fast_read)
                {
                    memHandle->commandSet.readMemoryCommand = kSerialNorCmd_ReadMemorySDR_1_4_4_A32;
                }
            }
            else if (kSPIFI_CommandDataQuad == memHandle->readmemCommandFormt &&
                     param_tbl->misc.support_1_1_4_fast_read)
            {
                mode_cycles  = param_tbl->read_1_4_info.mode_clocks_1_1_4_read;
                dummy_cycles = param_tbl->read_1_4_info.dummy_clocks_1_1_4_read;
                /* Calculate intermediate bytes precede the data */
                memHandle->intermediateLen              = (mode_cycles + dummy_cycles) / 8U;
                memHandle->commandSet.readMemoryCommand = kSerialNorCmd_ReadMemorySDR_1_1_4;
                if ((address_bits == 32U) && flash_4b_tbl->cmd_4byte_support_info.support_1_1_4_fast_read)
                {
                    memHandle->commandSet.readMemoryCommand = kSerialNorCmd_ReadMemorySDR_1_1_4_A32;
                }
            }

            /* Ideally, we only need one condition here, however, for some Flash devices that actually support JESD216A
             before the stanadard is publicly released, the JESD minor revsion is still the initial version. That is why
             we use two conditions to handle below logic. */
            if ((tbl->standard_version >= kSfdp_Version_Minor_A) ||
                (tbl->flash_param_tbl_size >= kSfdp_BasicProtocolTableSize_RevA))
            {
                switch (param_tbl->mode_4_4_info.quad_enable_requirement)
                {
                    case 1:
                    case 4:
                    case 5:
                        quadModeSetting = kSerialNorQuadMode_StatusReg2_Bit1;
                        break;
                    case 2:
                        quadModeSetting = kSerialNorQuadMode_StatusReg1_Bit6;
                        break;
                    case 3:
                        quadModeSetting = kSerialNorQuadMode_StatusReg2_Bit7;
                        break;
                    case 6:
                        quadModeSetting = kSerialNorQuadMode_StatusReg2_Bit1_0x31;
                        break;
                    case 0:
                    default:
                        quadModeSetting = kSerialNorQuadMode_NotConfig;
                        break;
                }
            }
            else
            {
                /* Use quad mode setting paraments provided in the configure option block.
                 This setting is used for the flash devices which only support JESD216 initial version. */
                quadModeSetting = memConfig->quad_mode_setting;
            }
            switch (quadModeSetting)
            {
                /* Need write status register1 and register2 at the same time with command 0x01.
                 See JESD216B doc for more details. */
                case kSerialNorQuadMode_StatusReg2_Bit1:
                    config->isQuadDualNeedEnable   = true;
                    config->writeTwoStausBytes     = true;
                    config->quadDualreadCommand    = kSerialNorCmd_ReadSecStatus_35;
                    config->quadDualEnableBitShift = 1;
                    break;
                /* Need write status register1 directly with command 0x01. */
                case kSerialNorQuadMode_StatusReg1_Bit6:
                    config->isQuadDualNeedEnable   = true;
                    config->writeTwoStausBytes     = false;
                    config->quadDualreadCommand    = kSerialNorCmd_ReadStatus;
                    config->quadDualEnableCommand  = kSerialNorCmd_WriteStatus;
                    config->quadDualEnableBitShift = 6;
                    break;
                /* Need write status register2 directly with special command 0x3E. */
                case kSerialNorQuadMode_StatusReg2_Bit7:
                    config->isQuadDualNeedEnable   = true;
                    config->writeTwoStausBytes     = false;
                    config->quadDualreadCommand    = kSerialNorCmd_ReadSecStatus_3F;
                    config->quadDualEnableCommand  = kSerialNorCmd_WriteSecStatus_3E;
                    config->quadDualEnableBitShift = 7;
                    break;
                /* Need write status register2 directly with special command 0x31. */
                case kSerialNorQuadMode_StatusReg2_Bit1_0x31:
                    config->isQuadDualNeedEnable   = true;
                    config->writeTwoStausBytes     = false;
                    config->quadDualreadCommand    = kSerialNorCmd_ReadSecStatus_35;
                    config->quadDualEnableCommand  = kSerialNorCmd_WriteSecStatus_31;
                    config->quadDualEnableBitShift = 1;
                    break;
                case kSerialNorQuadMode_NotConfig:
                default:
                    config->isQuadDualNeedEnable = false;
                    break;
            }
        }

        status = kStatus_Success;
    } while (0);

