chfanghr/SDK-devices-LPC54606-drivers-/SDK/components/flash/nor/spifi/fsl_spifi_nor_flash.c
    return status;
}

static status_t spifi_nor_erase_sector(nor_handle_t *handle, uint32_t address)
{
    if ((!handle) || (!handle->deviceSpecific))
    {
        return kStatus_InvalidArgument;
    }

    spifi_command_t cmd;
    status_t status;
    spifi_mem_nor_handle_t *memSpifiHandler = (spifi_mem_nor_handle_t *)(handle->deviceSpecific);
    SPIFI_Type *base                        = (SPIFI_Type *)handle->driverBaseAddr;
    uint8_t opcode                          = memSpifiHandler->commandSet.eraseSectorCommand;
    address &= ~(handle->bytesInSectorSize - 1);
    spifi_command_type_t cmdType = memSpifiHandler->commandType;

    /* Enable write operation. */
    status = spifi_nor_write_enable(base, memSpifiHandler, kSPIFI_CommandAllSerial);
    if (kStatus_Success != status)
    {
        return status;
    }
    /* Set address. */
    SPIFI_SetCommandAddress(base, address);

    /* Do erase operation. */
    cmd.dataLen           = 0;
    cmd.isPollMode        = false;
    cmd.direction         = kSPIFI_DataOutput;
    cmd.intermediateBytes = 0;
    cmd.format            = kSPIFI_CommandAllSerial;
    cmd.type              = cmdType;
    cmd.opcode            = opcode;
    SPIFI_SetCommand(base, &cmd);

    /* Check if finished. */
    status = spifi_check_norflash_finish(base, memSpifiHandler);

    return status;
}

status_t Nor_Flash_Init(nor_config_t *config, nor_handle_t *handle)
{
    assert(config);
    assert(handle);

    /* Set SPIFI configuration parameter. */
    SPIFI_Type *base = (SPIFI_Type *)config->driverBaseAddr;
    status_t status;
    jedec_info_table_t jedec_info_tbl;
    spifi_mem_nor_config_t *memSpiNorConfig = (spifi_mem_nor_config_t *)config->memControlConfig;
    spifi_nor_config_t spiNorConfig;

    /* Clear spifi nor flash configuration. */
    memset(&spiNorConfig, 0, sizeof(spifi_nor_config_t));
    memset(&spifi_handle, 0, sizeof(spifi_handle));
    /* Set default configuration to configuration block. */
    SPIFI_GetDefaultConfig(&spiNorConfig.memConfig);
    /* Store parameters in handler. */
    handle->driverBaseAddr                         = config->driverBaseAddr;
    handle->deviceSpecific                         = (void *)&spifi_handle;
    handle->bytesInMemorySize                      = SPIFI_MAX_24BIT_ADDRESSING_SIZE;
    spifi_handle.commandSet.readStatusCommand      = kSerialNorCmd_ReadStatus;
    spifi_handle.commandSet.eraseSectorCommand     = kSerialNorCmd_EraseSector;
    spifi_handle.commandSet.pageWriteMemoryCommand = kSerialNorCmd_WriteMemory;
    spifi_handle.commandSet.readMemoryCommand      = kSerialNorCmd_ReadMemory;
    spifi_handle.commandSet.writeDisableCommand    = kSerialNorCmd_WriteDisable;
    spifi_handle.commandSet.writeEnableCommand     = kSerialNorCmd_WriteEnable;
    spifi_handle.commandSet.writeStatusCommand     = kSerialNorCmd_WriteStatus;
    spifi_handle.commandSet.eraseChipCommand       = kSerialNorCmd_EraseChip;

    /* SPIFI Clock setting with the low frequency to get the sfdp first. */
    memSpiNorConfig->clockInit(kSpifiNorClockInit_Sdfp);
    /* Init SPIFI NOR flash based on default configure value for reading SFDP */
    SPIFI_Init(base, &spiNorConfig.memConfig);

    /* Read SFDP information via SPIFI */
    status = spifi_nor_read_sfdp_info(base, &jedec_info_tbl);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Parse SFDP parameters and then fill into SPIFI Serial NOR Configuration Block */
    status = spifi_nor_parse_sfdp(&spiNorConfig, &jedec_info_tbl, memSpiNorConfig, handle);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* SPIFI Clock setting with the maximum frequency. */
    memSpiNorConfig->clockInit(kSpifiNorClockInit_Max);
    /* Switch to quad mode if it is needed. */
    if (true == spiNorConfig.isQuadDualNeedEnable)
    {
        status = spifi_nor_quad_mode_enable(base, &spiNorConfig, &spifi_handle);
        if (status != kStatus_Success)
        {
            return status;
        }
    }
    /* Default disable write protection. */
    spifi_nor_writeprotect_disable(base, &spifi_handle);
    return status;
}

status_t Nor_Flash_Page_Program(nor_handle_t *handle, uint32_t address, uint8_t *buffer)
{
    if (!buffer)
    {
        return kStatus_InvalidArgument;
    }

    uint32_t data, i;
    spifi_command_t cmd;
    status_t status;
    spifi_mem_nor_handle_t *memSpifiHandler = (spifi_mem_nor_handle_t *)(handle->deviceSpecific);
    uint32_t pageSize                       = handle->bytesInPageSize;
    SPIFI_Type *base                        = (SPIFI_Type *)handle->driverBaseAddr;

    /* Enable write operation. */
    status = spifi_nor_write_enable(base, memSpifiHandler, kSPIFI_CommandAllSerial);
    if (kStatus_Success != status)
    {
        return status;
    }

    /* Keep address as page align. */
    address &= ~(pageSize - 1U);
    SPIFI_SetCommandAddress(base, address);

    cmd.dataLen           = pageSize;
    cmd.isPollMode        = false;
    cmd.direction         = kSPIFI_DataOutput;
    cmd.intermediateBytes = 0;
    cmd.format            = kSPIFI_CommandAllSerial;
    cmd.type              = memSpifiHandler->commandType;
    cmd.opcode            = memSpifiHandler->commandSet.pageWriteMemoryCommand;
    SPIFI_SetCommand(base, &cmd);
    for (i = 0; i < pageSize; i += 4U)
    {
        data = *(uint32_t *)buffer;
        buffer += 4U;
        SPIFI_WriteData(base, data);
    }

    status = spifi_check_norflash_finish(base, memSpifiHandler);

    return status;
}

status_t Nor_Flash_Erase_Block(nor_handle_t *handle, uint32_t address, uint32_t size_Byte)
{
    uint32_t endAddress = address + size_Byte;
    status_t status;

    if (endAddress > FSL_FEATURE_SPIFI_START_ADDR + handle->bytesInMemorySize)
    {
        return kStatus_InvalidArgument;
    }

    address &= ~(handle->bytesInSectorSize - 1);

    while (address < endAddress)
    {
        status = spifi_nor_erase_sector(handle, address);
        if (kStatus_Success != status)
        {
            return status;
        }
        address += handle->bytesInSectorSize;
    }

