chfanghr/SDK-devices-LPC54606-drivers-/SDK/components/flash/nor/spifi/fsl_spifi_nor_flash.c
    return status;
}

status_t Nor_Flash_Erase_Chip(nor_handle_t *handle)
{
    if ((!handle) || (!handle->deviceSpecific))
    {
        return kStatus_InvalidArgument;
    }

    spifi_command_t cmd;
    spifi_command_type_t cmdType = kSPIFI_CommandOpcodeOnly;
    status_t status;
    spifi_mem_nor_handle_t *memSpifiHandler = (spifi_mem_nor_handle_t *)(handle->deviceSpecific);
    SPIFI_Type *base                        = (SPIFI_Type *)handle->driverBaseAddr;
    uint8_t opcode                          = memSpifiHandler->commandSet.eraseChipCommand;

    /* Enable write operation. */
    status = spifi_nor_write_enable(base, memSpifiHandler, kSPIFI_CommandAllSerial);
    if (kStatus_Success != status)
    {
        return status;
    }
    /* Set address. */
    SPIFI_SetCommandAddress(base, FSL_FEATURE_SPIFI_START_ADDR);

    /* Do erase operation. */
    cmd.dataLen           = 0;
    cmd.isPollMode        = false;
    cmd.direction         = kSPIFI_DataOutput;
    cmd.intermediateBytes = 0;
    cmd.format            = kSPIFI_CommandAllSerial;
    cmd.type              = cmdType;
    cmd.opcode            = opcode;
    SPIFI_SetCommand(base, &cmd);

    /* Check if finished. */
    status = spifi_check_norflash_finish(base, memSpifiHandler);

    return status;
}

status_t Nor_Flash_Read(nor_handle_t *handle, uint32_t address, uint8_t *buffer, uint32_t length)
{
    /* Parameter check. */
    if ((!handle) || (!buffer))
    {
        return kStatus_InvalidArgument;
    }

    spifi_command_t cmd;
    status_t status                         = kStatus_Success;
    spifi_mem_nor_handle_t *memSpifiHandler = (spifi_mem_nor_handle_t *)(handle->deviceSpecific);
    SPIFI_Type *base                        = (SPIFI_Type *)handle->driverBaseAddr;

    cmd.dataLen           = 0;
    cmd.isPollMode        = false;
    cmd.direction         = kSPIFI_DataInput;
    cmd.intermediateBytes = memSpifiHandler->intermediateLen;
    cmd.format            = memSpifiHandler->readmemCommandFormt;
    cmd.type              = memSpifiHandler->commandType;
    cmd.opcode            = memSpifiHandler->commandSet.readMemoryCommand;
    SPIFI_SetMemoryCommand(base, &cmd);

    memcpy(buffer, (void *)address, length);
    /* Reset to command mode. */
    SPIFI_ResetCommand(base);

    return status;
}
